In [1]:
import pandas as pd

In [2]:
#import csv
schools_csv= "Resources/schools_complete.csv"

schools_df=pd.read_csv(schools_csv)
schools_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [11]:
students_csv="Resources/students_complete.csv"

students_df=pd.read_csv(students_csv)
students_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [7]:
#Table 1
#District Summary:
#Total Schools
total_schools= schools_df["School ID"].count()

print(total_schools)

15

In [8]:
#Total Students
total_students=schools_df["size"].sum()

print(total_students)

39170

In [9]:
#Total Budget
total_budget=schools_df["budget"].sum()

print(total_budget)

24649428

In [18]:
#Average Math Score district
math_score= students_df["math_score"].mean()

print(math_score)

78.98537145774827

In [32]:
# Average Reading School
reading_score=students_df["reading_score"].mean()

print(reading_score)

81.87784018381414

In [38]:
# Percent passing Math

percent_passing_math= ((students_df["math_score"] >=70)/(total_students)) * 100

print(percent_passing_math)

0        0.002553
1        0.000000
2        0.000000
3        0.000000
4        0.002553
           ...
39165    0.002553
39166    0.002553
39167    0.002553
39168    0.002553
39169    0.002553
Name: math_score, Length: 39170, dtype: float64

In [39]:
#Percent Passing Reading

percent_passing_reading=((students_df["reading_score"] >=70)/(total_students)) * 100

print(percent_passing_reading)

0        0.000000
1        0.002553
2        0.002553
3        0.000000
4        0.002553
           ...
39165    0.002553
39166    0.002553
39167    0.002553
39168    0.002553
39169    0.002553
Name: reading_score, Length: 39170, dtype: float64

In [ ]:
#percent overall passing

In [42]:
#Print
summary_df= pd.DataFrame({"Total Schools": [total_schools],
                         "Total Students": [total_students],
                         "Total Budget":total_budget,
                         "Average Math Score": math_score,
                         "Average Reading Score": reading_score})

summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score
0,15,39170,24649428,78.985371,81.87784

In [ ]:
#Table 2
#School Table
#School Name

In [ ]:
#School Type

In [ ]:
#Total Students

In [ ]:
#Total School Budget

In [ ]:
#Average Math Score

In [ ]:
#Average Reading Score

In [ ]:
#Percent Passing Math

In [ ]:
#Percent Passing Reading

In [ ]:
#Overall Percent passing

In [ ]:
#Table 3
#Top 5 peforming Schools
#Table two Information

In [ ]:
#Table 4
#Bottom Schools
#Table 2 Information

In [ ]:
#Table 5
#Average Math Scores by grade
#9th, 10th, 11th, 12th

In [ ]:
#Table 6
#Average Reading Scores by Grade
#9th, 10th, 11th, 12th

In [ ]:
#Table 7
#School Spending
#Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:

#Average Math Score
#Average Reading Score
#% Passing Math (The percentage of students that passed math.)
#% Passing Reading (The percentage of students that passed reading.)
#% Overall Passing (The percentage of students that passed math and reading.)

In [ ]:
#Table 8
#Score by School Size
#Repeat the above breakdown, but this time group schools based on a reasonable approximation of school size (Small, Medium, Large).

In [ ]:
#Table 9
#Scores by School Type
#Repeat the above breakdown, but this time group schools based on school type (Charter vs. District).